[{"source": ["<p>A young Canadian convert to Islam who killed a soldier in a hit-and-run had been on the radar of federal investigators, who feared he had jihadist ambitions and had seized his passport, according to federal authorities.</p>", "<p>The suspect was shot by police after a chase in the Quebec city of Saint-Jean-Sur-Richelieu. A second soldier suffered minor injuries in Monday's attack.</p>", "<p>Steven Blaney, Canada's public safety minister, said on Tuesday the attack was \"clearly linked to terrorist ideology\".</p>", "<p>Guy Lapointe, Quebec Police spokesman, said the act was deliberate and that one of the two soldiers was in uniform.</p>", "<p>He said there were no other suspects at this time.</p>", "<p>An official who spoke on condition of anonymity because he was not authorised to speak publicly about the case identified the suspect as Martin Couture-Rouleau, 25.</p>", "<p>The suspect was known to authorities and recently had his passport seized, Royal Canadian Mounted Police Commissioner Bob Paulson said.</p>", "<p>He was one of 90 suspected people in the country who intend to join battles abroad or who have returned from overseas.</p>", "<p>However, it was not known whether the suspect had any ties to armed groups.</p>", "<p>\"He was part of our investigative efforts to try and identify those people who might commit a criminal act travelling abroad for terrorist purposes,\" Paulson said.</p>", "<p>A Quebec business data base shows Couture-Rouleau started a water-pressure cleaning company in St-Jean-sur-Richelieu in 2012 with two other people.</p>", "<p><strong>Harper's tribute</strong></p>", "<p>Stephen Harper, Canada's prime minister, said the slain soldier, 53-year-old Warrant Officer Patrice Vincent, was a 28-year veteran with \"distinguished service\".</p>", "<p>\"Our thoughts and prayers are with his family members, his friends and his colleagues,\" the prime minister said.</p>", "<p>\"This was a despicable act of violence that strikes against not just this soldier and his colleagues but frankly against our very values as a civilised democracy,\" Harper said in parliament.</p>", "<p>Lapointe said the other victim is in stable condition with minor injuries.</p>", "<p><!-- PAGELOADEDSUCCESSFULLY--></p>", "<p>The suspect sat in his car in the parking lot outside a veterans' support centre for at least two hours before the hit and run, Lapointe said.</p>", "<p>A police officer on patrol witnessed what happened and immediately gave chase. He was was pursued for about 4km before he lost control of the car, which rolled over several times.</p>", "<p>Lapointe said the man was brandishing a knife when he emerged from the vehicle and police opened fire.</p>", "<p>The case is similar to one in London last year in which an al-Qaeda-inspired activist and another man ran over a soldier with a car before hacking the off-duty soldier to death.</p>", "<p>Images of Michael Adebolajo, 29, holding a butcher knife and cleaver with bloodied hands in the moments after the May 2013 killing of Fusilier Lee Rigby shocked people around the world and spread fears of terrorism in Britain.</p>", "<p>The Islamic State of Iraq and the Levant (ISIL) group has urged supporters to carry out attacks against Western countries, including Canada, that are participating in the US-led coalition fighting the group that has taken over large expanses of territory in Iraq and Syria.</p>", "<p>Eight Canadian fighter jets, including two spares, were set to depart for the region on Tuesday.</p>"], "link": ["http://www.aljazeera.com/news/americas/2014/10/canada-blames-terrorist-ideology-attack-201410212242663372.html"], "title": ["Canada blames 'terrorist ideology' for attack"]},
{"source": ["<p>It was a case that divided South Africa and resonated around the world: The Valentine's Day shooting of model and law graduate Reeva Steenkamp by South African Olympic and Paralympic sprinter Oscar Pistorius.</p>", "<p>Every twist and turn was played out in excruciating detail with Pistorius variously portrayed as a broken man who had suffered enough, or a killer who must pay for what he had done.</p>", "<p>The disabled athlete admitted killing his girlfriend on February 14 last year. But he said he did so by mistake, shooting her through a locked bathroom door because he thought she was an intruder.</p>", "<p>Sentencing Pistorius to five years in jail, Judge Thokozile Matilda Masipa said she was trying to strike a balance between mercy and retribution.</p>", "<p>Judge Masipa said: \"The following is what I consider to be a sentence that is fair and just, both to society and to the accused\".</p>", "<p>Under South Africa’s judicial system, Pistorius could serve just 10 months in prison before being placed under house arrest.</p>", "<p>So has the judge imposed sentencing to the letter of the law? Or bowed to the court of public opinion?</p>", "<p><strong style=\"font-size: 13px;\">Presenter:</strong><span style=\"font-size: 13px;\"> </span><span style=\"font-size: 13px;\"><a class=\"internallink\" href=\"https://twitter.com/mjahanna\">Mike Hanna</a></span></p>", "<p><strong>Guests:</strong></p>", "<p><strong>Mannie Witz</strong> - a criminal defence lawyer who served as a mentor to the Pistorius trial judge.</p>", "<p><strong>Duncan Lamont</strong> – a media lawyer.</p>", "<p><strong>Ayesha Kajee</strong> - a government and democracy consultant, and former executive director of the Freedom of Expression Institute.</p>"], "link": ["http://www.aljazeera.com/programmes/insidestory/2014/10/pistorius-trial-was-justice-served-20141021164341697894.html"], "title": ["Pistorius trial: Was justice served?"]},
{"source": ["<p>Hong Kong student representatives and government officials have held much-awaited talks to end street protests now in their fourth week, but achieved little progress to defuse the crisis in China's semi-autonomous city.</p>", "<p>In opening remarks, student leader Alex Chow said that an August decision by China's legislature ruling out direct elections for the city's chief executive in 2017 had \"emasculated\" Hong Kong.</p>", "<p>\"We don't want anointment,\" Chow, secretary-general of the Hong Kong Federation of Students, one of three groups leading the protests, said at the talks on Tuesday.</p>", "<p>Government officials stuck to the official position that Hong Kong's mini-constitution cannot be amended to accommodate protesters' demands, while also saying that many others do not share their views.</p>", "<p>\"We hope you would understand that there are a lot of people who are not in Mong Kok, who are not in Admiralty, many people at home who aren't insisting on civil nomination,\" said Justice Secretary Rimsky Yuen.</p>", "<p><strong>Live telecast</strong></p>", "<p>People gathered at the three main protest zones to watch the talks on big screens, and frequently cheered at remarks by the student leaders.</p>", "<p>But many held little hope that the talks would end the impasse, though they thought broadcasting them would help get their position out to the wider population.</p>", "<p>Al Jazeera's Divya Gopalan, reporting from Admiralty, one of the main protest sites, said the talks seemed to have done little to dampen the protests. </p>", "<p>She said student leaders appearing on a stage at Admiralty after the talks were met with loud cheers by thousands of people gathered.</p>", "<p>\"They told the crowd that they did not get a practical response from the government and they are disappointed in the discussions,\" she said. \"They urged protesters to carry on occupying sites, saying that the five speakers at the talks are not enough to convince the government to address their issues.\"</p>", "<p>Chief Executive Leung Chun-ying told reporters ahead of the talks that the government would not let the public nominate candidates to run in inaugural direct elections to succeed him in 2017, as demanded by thousands of protesters camping out on main streets across the city. But he added that there was room to discuss how to form a key 1,200-member committee that would pick candidates.</p>", "<p>Leung said such changes could be covered in a second round of consultations over the next several months.</p>", "<p>\"How we should elect the 1,200 so that the nominating committee will be broadly representative, there's room for discussion there,\" Leung said. \"There's room to make the nominating committee more democratic, and this is one of the things we very much want to talk to not just the students but the community at large about.\"</p>", "<p>Protesters have occupied main streets in three areas of the city since September 28 to demand that the government abandon plans to use the screening committee.</p>", "<p><strong>ANALYSIS FROM OUR CORRESPONDENT</strong></p>", "<p>The talks have mostly highlighted that the hands of Hong Kong's government are tied. While the government says it is compromising, the protesters have expressed disappointment and have vowed to continue demonstrations.</p>", "<p>Carrie Lam, the chief secretary, led the discussions on the government side. From the start she reminded the student leaders that Hong Kong is not independent, and is part of China.</p>", "<p><!-- PAGELOADEDSUCCESSFULLY-->The government has said it will look into widening the criteria for the 1,200 people that form the nominating committee which chooses the candidate for Hong Kong's chief executive. They say they will take into account public opinion and make the process more transparent. This is the issue at the heart of the protests, which are calling for a change in the basic law to allow Hong Kong's citizens to choose their chief executive directly.</p>", "<p>The protesters are also calling on the government to represent them, instead of being a conduit for Beijing's desires.</p>", "<p>Some analysts say though that student leaders themselves have not put forward any workable proposals, to meet the government in the middle.</p>", "<p>There was little optimism before the talks, and Hong Kong's chief executive angered many with remarks he made in an interview, saying that if there was full democracy in Hong Kong, it would be the poor and the working class that would dominate the decisions.</p>", "<p>Hong Kong has the world's highest concentration of millionaires, but 1 in 5 people live in poverty.</p>"], "link": ["http://www.aljazeera.com/news/asia-pacific/2014/10/hong-kong-talks-fail-break-impasse-2014102113431848271.html"], "title": ["Hong Kong talks fail to break impasse"]},
{"source": ["<p>Israeli soldiers have been accused of abusing a mentally disabled Palestinian boy for reportedly throwing stones<span>, a human rights group has said.</span></p>", "<p>Footage captured on Sunday showed two soldiers roughing up an 11-year-old child in Hebron, in the occupied West Bank, on suspicion he had thrown stones at troops.</p>", "<p><span>B'Tselem, an Israeli human rights group, said the child who cannot speak, was handcuffed, blindfolded and bundled into the back of a jeep, despite cries by nearby Palestinians that he was mentally impaired.</span></p>", "<p><span>He was reportedly held on the floor of the vehicle for 15 minutes before his father arrived and convinced the soldiers that he be released.</span></p>", "<p><span>Residents of the nearby <span lang=\"EN-GB\">Kiryat Arba</span> Israeli settlement could be heard cheering the soliders in the video.  </span></p>", "<p><span>On Monday, Palestinians in the West Bank town of Sinjil accused an Israeli settler of killing a schoolgirl and injuring another in a hit-and-run.<br></span></p>", "<p><span>The Palestinian Ambassador to the UN, Riyad Mansour, said two girls were hit by a speeding car while crossing the road to their mothers after leaving a school bus.</span></p>", "<p>Mansour, said Inas Khalil, 5, died as a result of her injuries, and Nilin Asfour, 8, was in critical condition.</p>"], "link": ["http://www.aljazeera.com/news/middleeast/2014/10/israeli-troops-abuse-palestinian-boy-20141021171333568741.html"], "title": ["Israeli troops 'abuse' Palestinian boy"]},
{"source": ["<p>An Egyptian court has set a date for an appeals hearing in the case of three Al Jazeera English journalists jailed since last year.</p>", "<p>Al Jazeera said on Tuesday that Mohamed Fahmy, Baher Mohamed and Peter Greste have been scheduled to appear in court on January 1, 2015, to appeal against their convictions.</p>", "<p>The trio have been imprisoned in Egypt for 297 days, after being falsely accused and then found guilty of aiding the outlawed Muslim Brotherhood.</p>", "<p>Al Jazeera has dismissed the allegations and has repeatedly called for the release of its staff.</p>", "<p>Lawyer Negad Borai, who is representing Fahmy, told the Associated Press news agency he expects Egypt's Court of Cassation to take one or two sessions to either send the case back to criminal court or uphold the original verdict.</p>", "<p><span>Greste and Fahmy were sentenced to seven years in prison, while Mohamed received an additional three years for having a spent bullet in his possession, which he had picked up at a protest.</span></p>", "<p>The journalists have repeatedly said that they are being punished for just doing their jobs.</p>", "<p>The judge who sentenced the journalists released his reasoning in July, saying they were brought together \"by the devil\" to destabilise the country.</p>", "<p>Amnesty International called the trial a \"farcical spectacle\" and a \"ferocious attack on media freedom\".</p>", "<p>Since the <a class=\"internallink\" href=\"http://www.aljazeera.com/news/middleeast/2014/08/appeal-filed-over-jailed-al-jazeera-staff-2014821123437168213.html\" target=\"_blank\">appeal was filed</a>, another Al Jazeera journalist in a separate case, <a class=\"internallink\" href=\"http://www.aljazeera.com/pressoffice/2014/10/al-jazeera-journalist-sentenced-egypt-20141014104613955831.html\" target=\"_blank\">Ahmed Mansour</a>, was convicted in absentia to 15 years in jail.</p>", "<p>Al Jazeera will mark 300 days since the arrest of its journalists on October 24, with 300 seconds of on-air silence.</p>"], "link": ["http://www.aljazeera.com/news/middleeast/2014/10/egypt-sets-appeal-date-al-jazeera-staff-20141021145925423577.html"], "title": ["Egypt sets appeal date for Al Jazeera staff"]},
{"source": ["<p>A series of bombs targeting restaurants across the Iraqi capital Baghdad have killed at least 21 people, police and medics said.</p>", "<p>Twelve people were killed in Baghdad's northern Talibiya district on Tuesday when a car bomb blew up directly in front of a restaurant and another in a parking area.</p>", "<p>A homemade bomb exploded close to a restaurant in Baghdad's Sheikh Omar neighbourhood, killing two civilians, and two more blasts near restaurants in the south of the capital left a further seven people dead, police and medical sources said.</p>", "<p>The bombings are the latest in a series targeting members of Iraq's Shia majority who are considered heretics by fighters from the Islamic State of Iraq and the Levant (ISIL).</p>", "<p>ISIL has overrun large parts of Iraq and neighbouring Syria and surged towards Baghdad in June after seizing the northern city of Mosul but have not captured the capital.</p>"], "link": ["http://www.aljazeera.com/news/middleeast/2014/10/multiple-car-bombings-rock-baghdad-20141021123851744922.html"], "title": ["Multiple car bombings rock Baghdad"]},
{"source": ["<p>Sweden's military has for a fifth day dispatched forces to the Stockholm archipelago after reports of \"foreign underwater activity\" in the area.</p>", "<p>Battleships, minesweepers, helicopters and more than 200 troops have scoured an area about 30 to 60 kilometres from the Swedish capital since Friday following reports of a \"man-made object\" in the water.</p>", "<p>Supreme Commander General Sverker Goranson said there was \"probable underwater activity\" off the coast of Stockholm and he was ready to use \"armed force\" to bring the mystery vessel to the surface.</p>", "<p>Sweden released a hazy photograph of what might be a mini-sub on Sunday.</p>", "<p>\"The most important value of the operation - regardless of whether we find something - is to send a very clear signal that Sweden and its armed forces are acting and are ready to act when we think this kind of activity is violating our borders,\" the general said.</p>", "<p>\"Our aim now is to force whatever it is up to the surface... with armed force, if necessary,\" he added.</p>", "<p>Despite widespread speculation that the \"activity\" is a Russian mini submarine - amid unconfirmed reports of intercepted transmissions to the Russian enclave of Kaliningrad on the other side of the Baltic Sea - authorities in Sweden have not singled out Russia in their comments.</p>", "<p><strong>Russian denial</strong></p>", "<p>Russia has denied having any submarine in the area, and pointed the finger at the Netherlands, which laughed off the claim, saying its submarine had already docked in the Estonian capital Tallinn after taking part in exercises with the Swedish navy.</p>", "<p>Goranson said it was it was \"extremely difficult\" to locate submarines.</p>", "<p>\"We never succeeded in the past - and no one else has either.\"</p>", "<p>Still, he said the massive military operation - which focused Tuesday afternoon on the island of Ingaro, just 30km from Stockholm - would continue for as long as necessary.</p>", "<p>During more than a decade of hunting Russian U-boats in the 1980s and early 90s, Sweden never succeeded in capturing one, except in 1981 when the U137 ran aground 10km from one of Sweden's largest naval bases, triggering a diplomatic stand-off with Russia.</p>", "<p>Sweden has since downsized its military significantly and has scrapped some of the resources it used to hunt for Soviet submarines, including helicopters equipped with sonar and anti-submarine weapons.</p>", "<p>Early Tuesday afternoon, at least five naval ships were stationed for more than two hours in an area east of Ingaro, the closest reported point to the Swedish mainland since the operation began. </p>", "<p>The armed forces have said the military search operation is taking place in \"an area of interest for foreign powers\" and that throughout the years, several observations of suspected foreign underwater activity have been made in the same area. </p>", "<p>Tensions have risen around the Baltic since the military operation began with Latvian Foreign Minister Edgars Rinkevics calling it a potential \"game changer\" for the security of the region. </p>"], "link": ["http://www.aljazeera.com/news/europe/2014/10/sweden-hunts-underwater-vessel-2014102115545207152.html"], "title": ["Sweden hunts for mystery 'underwater vessel'"]},
{"source": ["<p>Kurdish fighters in the battle for the Syrian town of Kobane weathered a fresh onslaught by fighters from the Islamic State of Iraq and the Levant (ISIL) as they awaited promised reinforcements from Iraq.</p>", "<p>The Kurdish militia faced fierce attacks on Tuesday, fresh from heavy battles on Monday evening in which ISIL appeared to be trying to cut off the border with Turkey before the reinforcements could arrive.</p>", "<p>This account is according to the Syrian Observatory for Human Rights, who also reported that coalition forces carried out further air strikes overnight, following weeks of attacks in and around Kobane.</p>", "<p><!-- PAGELOADEDSUCCESSFULLY--></p>", "<p>Ankara's announcement on Monday that it would facilitate Kurdish forces from Iraq crossing its border with Syria to relieve Kobane's beleaguered defenders marked a major shift of policy and was swiftly welcomed by the US.</p>", "<p>Kobane has become a crucial symbolic battleground in the war against ISIL, which is fighting to extend areas under its control in Iraq and Syria, where it has declared an Islamic \"caliphate\" that has not been widely-recognised.</p>", "<p>An influx of well-trained Peshmerga fighters into Kobane could be a major boost for the Syrian Kurds.</p>", "<p>Iraqi Kurdish officials have said they would provide training, although any forces sent would be Syrian Kurds.</p>", "<p>The US has also stepped up its commitment to the town's defence in recent days, with Secretary of State John Kerry saying it would be \"irresponsible\" and \"morally very difficult\" not to help.</p>", "<p><strong>Botched airdrop</strong></p>", "<p>Three C-130 cargo aircraft carried out what the US military called \"multiple\" successful drops of supplies early on Monday, including arms provided by Kurdish authorities in Iraq.</p>", "<p>However, ISIL fighters reportedly seized one cache of the airdropped weapons that included hand grenades, ammunition and rocket-propelled grenade launchers.</p>", "<p>The Britain-based observatory said the armed group had seized at least once cache amid heavy wind, but could have captured more.</p>", "<p>Syrian Kurdish officials have been lobbying Western governments for support, arguing their fighters are secular, relatively moderate and opposed to ISIL.</p>"], "link": ["http://www.aljazeera.com/news/middleeast/2014/10/isil-launches-fierce-new-assault-kobane-201410219413238741.html"], "title": ["ISIL 'launches fierce new assault' on Kobane"]},
{"source": ["<p>The UN says it will begin investigating attacks on its facilities during Israel's recent war against Hamas in Gaza, that killed more than 2,100 Palestinians.</p>", "<p>UN Secretary-General Ban Ki-moon said on Tuesday that the world body was investigating a deadly strike near one of its schools in the Gaza Strip and the alleged use of UN sites to store weapons.</p>", "<p>\"I am planning to move forward with an independent board of inquiry to look into the most serious cases, as well as instances in which weaponry was found on UN premises,\" Ban said at a monthly meeting of the UN Security Council.</p>", "<p>More than 2,100 Palestinians, most of them civilians, were killed during 50 days of fighting in July-August between Israel and Palestinian groups; while 108,000 people remain homeless.</p>", "<p>Ban's spokesman Stephane Dujarric said the inquiry was standard procedure whenever UN facilities are targeted.</p>", "<p>In one incident, more than a dozen people were <a class=\"internallink\" href=\"http://www.aljazeera.com/news/middleeast/2014/08/israeli-bombardment-claims-lives-gaza-20148372122193560.html\" target=\"_blank\">killed at a UN school</a> during Israeli shelling. Israel has cited Hamas' use of UN facilities to store rockets as a reason for targeting them.</p>", "<p>The UN Human Rights Council had previously set up a <a class=\"internallink\" href=\"http://www.aljazeera.com/news/middleeast/2014/08/un-names-gaza-war-crimes-probe-panel-2014811231432316350.html\" target=\"_blank\">Commission of Inquiry</a> to investigate alleged violations of humanitarian and human rights laws during the conflict.</p>", "<p>Israel's military also last month <a class=\"internallink\" href=\"http://www.aljazeera.com/news/middleeast/2014/09/israel-gaza-war-probe-201491020115680284.html\" target=\"_blank\">opened five criminal investigations</a> into its Gaza war operations, including attacks that killed four Palestinian children on a beach and 17 people at a UN school.</p>", "<p>An estimated 20,000 homes were badly damaged or destroyed in the fighting and Gaza's power station and other major infrastructure were hit, with rebuilding expected to take years.</p>"], "link": ["http://www.aljazeera.com/news/middleeast/2014/10/un-announces-gaza-war-inquiry-20141021191433499458.html"], "title": ["UN announces Gaza war inquiry"]}]